Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl702_driver/regs/dma_reg.h
/**
  ******************************************************************************
  * @file    dma_reg.h
  * @version V1.2
  * @date    2020-03-30
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2019 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __DMA_REG_H__
#define __DMA_REG_H__

#include "bl702.h"

/* 0x0 : DMA_IntStatus */
#define DMA_INTSTATUS_OFFSET (0x0)
#define DMA_INTSTATUS        DMA_INTSTATUS
#define DMA_INTSTATUS_POS    (0U)
#define DMA_INTSTATUS_LEN    (8U)
#define DMA_INTSTATUS_MSK    (((1U << DMA_INTSTATUS_LEN) - 1) << DMA_INTSTATUS_POS)
#define DMA_INTSTATUS_UMSK   (~(((1U << DMA_INTSTATUS_LEN) - 1) << DMA_INTSTATUS_POS))

/* 0x4 : DMA_IntTCStatus */
#define DMA_INTTCSTATUS_OFFSET (0x4)
#define DMA_INTTCSTATUS        DMA_INTTCSTATUS
#define DMA_INTTCSTATUS_POS    (0U)
#define DMA_INTTCSTATUS_LEN    (8U)
#define DMA_INTTCSTATUS_MSK    (((1U << DMA_INTTCSTATUS_LEN) - 1) << DMA_INTTCSTATUS_POS)
#define DMA_INTTCSTATUS_UMSK   (~(((1U << DMA_INTTCSTATUS_LEN) - 1) << DMA_INTTCSTATUS_POS))

/* 0x8 : DMA_IntTCClear */
#define DMA_INTTCCLEAR_OFFSET (0x8)
#define DMA_INTTCCLEAR        DMA_INTTCCLEAR
#define DMA_INTTCCLEAR_POS    (0U)
#define DMA_INTTCCLEAR_LEN    (8U)
#define DMA_INTTCCLEAR_MSK    (((1U << DMA_INTTCCLEAR_LEN) - 1) << DMA_INTTCCLEAR_POS)
#define DMA_INTTCCLEAR_UMSK   (~(((1U << DMA_INTTCCLEAR_LEN) - 1) << DMA_INTTCCLEAR_POS))

/* 0xC : DMA_IntErrorStatus */
#define DMA_INTERRORSTATUS_OFFSET (0xC)
#define DMA_INTERRORSTATUS        DMA_INTERRORSTATUS
#define DMA_INTERRORSTATUS_POS    (0U)
#define DMA_INTERRORSTATUS_LEN    (8U)
#define DMA_INTERRORSTATUS_MSK    (((1U << DMA_INTERRORSTATUS_LEN) - 1) << DMA_INTERRORSTATUS_POS)
#define DMA_INTERRORSTATUS_UMSK   (~(((1U << DMA_INTERRORSTATUS_LEN) - 1) << DMA_INTERRORSTATUS_POS))

/* 0x10 : DMA_IntErrClr */
#define DMA_INTERRCLR_OFFSET (0x10)
#define DMA_INTERRCLR        DMA_INTERRCLR
#define DMA_INTERRCLR_POS    (0U)
#define DMA_INTERRCLR_LEN    (8U)
#define DMA_INTERRCLR_MSK    (((1U << DMA_INTERRCLR_LEN) - 1) << DMA_INTERRCLR_POS)
#define DMA_INTERRCLR_UMSK   (~(((1U << DMA_INTERRCLR_LEN) - 1) << DMA_INTERRCLR_POS))

/* 0x14 : DMA_RawIntTCStatus */
#define DMA_RAWINTTCSTATUS_OFFSET (0x14)
#define DMA_RAWINTTCSTATUS        DMA_RAWINTTCSTATUS
#define DMA_RAWINTTCSTATUS_POS    (0U)
#define DMA_RAWINTTCSTATUS_LEN    (8U)
#define DMA_RAWINTTCSTATUS_MSK    (((1U << DMA_RAWINTTCSTATUS_LEN) - 1) << DMA_RAWINTTCSTATUS_POS)
#define DMA_RAWINTTCSTATUS_UMSK   (~(((1U << DMA_RAWINTTCSTATUS_LEN) - 1) << DMA_RAWINTTCSTATUS_POS))

/* 0x18 : DMA_RawIntErrorStatus */
#define DMA_RAWINTERRORSTATUS_OFFSET (0x18)
#define DMA_RAWINTERRORSTATUS        DMA_RAWINTERRORSTATUS
#define DMA_RAWINTERRORSTATUS_POS    (0U)
#define DMA_RAWINTERRORSTATUS_LEN    (8U)
#define DMA_RAWINTERRORSTATUS_MSK    (((1U << DMA_RAWINTERRORSTATUS_LEN) - 1) << DMA_RAWINTERRORSTATUS_POS)
#define DMA_RAWINTERRORSTATUS_UMSK   (~(((1U << DMA_RAWINTERRORSTATUS_LEN) - 1) << DMA_RAWINTERRORSTATUS_POS))

/* 0x1C : DMA_EnbldChns */
#define DMA_ENBLDCHNS_OFFSET     (0x1C)
#define DMA_ENABLEDCHANNELS      DMA_ENABLEDCHANNELS
#define DMA_ENABLEDCHANNELS_POS  (0U)
#define DMA_ENABLEDCHANNELS_LEN  (8U)
#define DMA_ENABLEDCHANNELS_MSK  (((1U << DMA_ENABLEDCHANNELS_LEN) - 1) << DMA_ENABLEDCHANNELS_POS)
#define DMA_ENABLEDCHANNELS_UMSK (~(((1U << DMA_ENABLEDCHANNELS_LEN) - 1) << DMA_ENABLEDCHANNELS_POS))

/* 0x20 : DMA_SoftBReq */
#define DMA_SOFTBREQ_OFFSET (0x20)
#define DMA_SOFTBREQ        DMA_SOFTBREQ
#define DMA_SOFTBREQ_POS    (0U)
#define DMA_SOFTBREQ_LEN    (32U)
#define DMA_SOFTBREQ_MSK    (((1U << DMA_SOFTBREQ_LEN) - 1) << DMA_SOFTBREQ_POS)
#define DMA_SOFTBREQ_UMSK   (~(((1U << DMA_SOFTBREQ_LEN) - 1) << DMA_SOFTBREQ_POS))

/* 0x24 : DMA_SoftSReq */
#define DMA_SOFTSREQ_OFFSET (0x24)
#define DMA_SOFTSREQ        DMA_SOFTSREQ
#define DMA_SOFTSREQ_POS    (0U)
#define DMA_SOFTSREQ_LEN    (32U)
#define DMA_SOFTSREQ_MSK    (((1U << DMA_SOFTSREQ_LEN) - 1) << DMA_SOFTSREQ_POS)
#define DMA_SOFTSREQ_UMSK   (~(((1U << DMA_SOFTSREQ_LEN) - 1) << DMA_SOFTSREQ_POS))

/* 0x28 : DMA_SoftLBReq */
#define DMA_SOFTLBREQ_OFFSET (0x28)
#define DMA_SOFTLBREQ        DMA_SOFTLBREQ
#define DMA_SOFTLBREQ_POS    (0U)
#define DMA_SOFTLBREQ_LEN    (32U)
#define DMA_SOFTLBREQ_MSK    (((1U << DMA_SOFTLBREQ_LEN) - 1) << DMA_SOFTLBREQ_POS)
#define DMA_SOFTLBREQ_UMSK   (~(((1U << DMA_SOFTLBREQ_LEN) - 1) << DMA_SOFTLBREQ_POS))

/* 0x2C : DMA_SoftLSReq */
#define DMA_SOFTLSREQ_OFFSET (0x2C)
#define DMA_SOFTLSREQ        DMA_SOFTLSREQ
#define DMA_SOFTLSREQ_POS    (0U)
#define DMA_SOFTLSREQ_LEN    (32U)
#define DMA_SOFTLSREQ_MSK    (((1U << DMA_SOFTLSREQ_LEN) - 1) << DMA_SOFTLSREQ_POS)
#define DMA_SOFTLSREQ_UMSK   (~(((1U << DMA_SOFTLSREQ_LEN) - 1) << DMA_SOFTLSREQ_POS))

/* 0x30 : DMA_Top_Config */
#define DMA_TOP_CONFIG_OFFSET (0x30)
#define DMA_E                 DMA_E
#define DMA_E_POS             (0U)
#define DMA_E_LEN             (1U)
#define DMA_E_MSK             (((1U << DMA_E_LEN) - 1) << DMA_E_POS)
#define DMA_E_UMSK            (~(((1U << DMA_E_LEN) - 1) << DMA_E_POS))
#define DMA_M                 DMA_M
#define DMA_M_POS             (1U)
#define DMA_M_LEN             (1U)
#define DMA_M_MSK             (((1U << DMA_M_LEN) - 1) << DMA_M_POS)
#define DMA_M_UMSK            (~(((1U << DMA_M_LEN) - 1) << DMA_M_POS))

/* 0x34 : DMA_Sync */
#define DMA_SYNC_OFFSET (0x34)
#define DMA_SYNC        DMA_SYNC
#define DMA_SYNC_POS    (0U)
#define DMA_SYNC_LEN    (32U)
#define DMA_SYNC_MSK    (((1U << DMA_SYNC_LEN) - 1) << DMA_SYNC_POS)
#define DMA_SYNC_UMSK   (~(((1U << DMA_SYNC_LEN) - 1) << DMA_SYNC_POS))

