Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl702_driver/regs/dma_reg.h
#if 0
/* 0x100 : DMA_C0SrcAddr */
#define DMA_C0SRCADDR_OFFSET   (0x100)
#define DMA_SRCADDR            DMA_SRCADDR
#define DMA_SRCADDR_POS        (0U)
#define DMA_SRCADDR_LEN        (32U)
#define DMA_SRCADDR_MSK        (((1U << DMA_SRCADDR_LEN) - 1) << DMA_SRCADDR_POS)
#define DMA_SRCADDR_UMSK       (~(((1U << DMA_SRCADDR_LEN) - 1) << DMA_SRCADDR_POS))

/* 0x104 : DMA_C0DstAddr */
#define DMA_C0DSTADDR_OFFSET   (0x104)
#define DMA_DSTADDR            DMA_DSTADDR
#define DMA_DSTADDR_POS        (0U)
#define DMA_DSTADDR_LEN        (32U)
#define DMA_DSTADDR_MSK        (((1U << DMA_DSTADDR_LEN) - 1) << DMA_DSTADDR_POS)
#define DMA_DSTADDR_UMSK       (~(((1U << DMA_DSTADDR_LEN) - 1) << DMA_DSTADDR_POS))

/* 0x108 : DMA_C0LLI */
#define DMA_C0LLI_OFFSET       (0x108)
#define DMA_LLI                DMA_LLI
#define DMA_LLI_POS            (0U)
#define DMA_LLI_LEN            (32U)
#define DMA_LLI_MSK            (((1U << DMA_LLI_LEN) - 1) << DMA_LLI_POS)
#define DMA_LLI_UMSK           (~(((1U << DMA_LLI_LEN) - 1) << DMA_LLI_POS))

/* 0x10C : DMA_C0Control */
#define DMA_C0CONTROL_OFFSET   (0x10C)
#define DMA_TRANSFERSIZE       DMA_TRANSFERSIZE
#define DMA_TRANSFERSIZE_POS   (0U)
#define DMA_TRANSFERSIZE_LEN   (12U)
#define DMA_TRANSFERSIZE_MSK   (((1U << DMA_TRANSFERSIZE_LEN) - 1) << DMA_TRANSFERSIZE_POS)
#define DMA_TRANSFERSIZE_UMSK  (~(((1U << DMA_TRANSFERSIZE_LEN) - 1) << DMA_TRANSFERSIZE_POS))
#define DMA_SBSIZE             DMA_SBSIZE
#define DMA_SBSIZE_POS         (12U)
#define DMA_SBSIZE_LEN         (2U)
#define DMA_SBSIZE_MSK         (((1U << DMA_SBSIZE_LEN) - 1) << DMA_SBSIZE_POS)
#define DMA_SBSIZE_UMSK        (~(((1U << DMA_SBSIZE_LEN) - 1) << DMA_SBSIZE_POS))
#define DMA_DST_MIN_MODE       DMA_DST_MIN_MODE
#define DMA_DST_MIN_MODE_POS   (14U)
#define DMA_DST_MIN_MODE_LEN   (1U)
#define DMA_DST_MIN_MODE_MSK   (((1U << DMA_DST_MIN_MODE_LEN) - 1) << DMA_DST_MIN_MODE_POS)
#define DMA_DST_MIN_MODE_UMSK  (~(((1U << DMA_DST_MIN_MODE_LEN) - 1) << DMA_DST_MIN_MODE_POS))
#define DMA_DBSIZE             DMA_DBSIZE
#define DMA_DBSIZE_POS         (15U)
#define DMA_DBSIZE_LEN         (2U)
#define DMA_DBSIZE_MSK         (((1U << DMA_DBSIZE_LEN) - 1) << DMA_DBSIZE_POS)
#define DMA_DBSIZE_UMSK        (~(((1U << DMA_DBSIZE_LEN) - 1) << DMA_DBSIZE_POS))
#define DMA_DST_ADD_MODE       DMA_DST_ADD_MODE
#define DMA_DST_ADD_MODE_POS   (17U)
#define DMA_DST_ADD_MODE_LEN   (1U)
#define DMA_DST_ADD_MODE_MSK   (((1U << DMA_DST_ADD_MODE_LEN) - 1) << DMA_DST_ADD_MODE_POS)
#define DMA_DST_ADD_MODE_UMSK  (~(((1U << DMA_DST_ADD_MODE_LEN) - 1) << DMA_DST_ADD_MODE_POS))
#define DMA_SWIDTH             DMA_SWIDTH
#define DMA_SWIDTH_POS         (18U)
#define DMA_SWIDTH_LEN         (2U)
#define DMA_SWIDTH_MSK         (((1U << DMA_SWIDTH_LEN) - 1) << DMA_SWIDTH_POS)
#define DMA_SWIDTH_UMSK        (~(((1U << DMA_SWIDTH_LEN) - 1) << DMA_SWIDTH_POS))
#define DMA_DWIDTH             DMA_DWIDTH
#define DMA_DWIDTH_POS         (21U)
#define DMA_DWIDTH_LEN         (2U)
#define DMA_DWIDTH_MSK         (((1U << DMA_DWIDTH_LEN) - 1) << DMA_DWIDTH_POS)
#define DMA_DWIDTH_UMSK        (~(((1U << DMA_DWIDTH_LEN) - 1) << DMA_DWIDTH_POS))
#define DMA_FIX_CNT            DMA_FIX_CNT
#define DMA_FIX_CNT_POS        (23U)
#define DMA_FIX_CNT_LEN        (2U)
#define DMA_FIX_CNT_MSK        (((1U << DMA_FIX_CNT_LEN) - 1) << DMA_FIX_CNT_POS)
#define DMA_FIX_CNT_UMSK       (~(((1U << DMA_FIX_CNT_LEN) - 1) << DMA_FIX_CNT_POS))
#define DMA_SLARGERD           DMA_SLARGERD
#define DMA_SLARGERD_POS       (25U)
#define DMA_SLARGERD_LEN       (1U)
#define DMA_SLARGERD_MSK       (((1U << DMA_SLARGERD_LEN) - 1) << DMA_SLARGERD_POS)
#define DMA_SLARGERD_UMSK      (~(((1U << DMA_SLARGERD_LEN) - 1) << DMA_SLARGERD_POS))
#define DMA_SI                 DMA_SI
#define DMA_SI_POS             (26U)
#define DMA_SI_LEN             (1U)
#define DMA_SI_MSK             (((1U << DMA_SI_LEN) - 1) << DMA_SI_POS)
#define DMA_SI_UMSK            (~(((1U << DMA_SI_LEN) - 1) << DMA_SI_POS))
#define DMA_DI                 DMA_DI
#define DMA_DI_POS             (27U)
#define DMA_DI_LEN             (1U)
#define DMA_DI_MSK             (((1U << DMA_DI_LEN) - 1) << DMA_DI_POS)
#define DMA_DI_UMSK            (~(((1U << DMA_DI_LEN) - 1) << DMA_DI_POS))
#define DMA_PROT               DMA_PROT
#define DMA_PROT_POS           (28U)
#define DMA_PROT_LEN           (3U)
#define DMA_PROT_MSK           (((1U << DMA_PROT_LEN) - 1) << DMA_PROT_POS)
#define DMA_PROT_UMSK          (~(((1U << DMA_PROT_LEN) - 1) << DMA_PROT_POS))
#define DMA_I                  DMA_I
#define DMA_I_POS              (31U)
#define DMA_I_LEN              (1U)
#define DMA_I_MSK              (((1U << DMA_I_LEN) - 1) << DMA_I_POS)
#define DMA_I_UMSK             (~(((1U << DMA_I_LEN) - 1) << DMA_I_POS))

/* 0x110 : DMA_C0Config */
#define DMA_C0CONFIG_OFFSET    (0x110)
#define DMA_E                  DMA_E
#define DMA_E_POS              (0U)
#define DMA_E_LEN              (1U)
#define DMA_E_MSK              (((1U << DMA_E_LEN) - 1) << DMA_E_POS)
#define DMA_E_UMSK             (~(((1U << DMA_E_LEN) - 1) << DMA_E_POS))
#define DMA_SRCPERIPHERAL      DMA_SRCPERIPHERAL
#define DMA_SRCPERIPHERAL_POS  (1U)
#define DMA_SRCPERIPHERAL_LEN  (5U)
#define DMA_SRCPERIPHERAL_MSK  (((1U << DMA_SRCPERIPHERAL_LEN) - 1) << DMA_SRCPERIPHERAL_POS)
#define DMA_SRCPERIPHERAL_UMSK (~(((1U << DMA_SRCPERIPHERAL_LEN) - 1) << DMA_SRCPERIPHERAL_POS))
#define DMA_DSTPERIPHERAL      DMA_DSTPERIPHERAL
#define DMA_DSTPERIPHERAL_POS  (6U)
#define DMA_DSTPERIPHERAL_LEN  (5U)
#define DMA_DSTPERIPHERAL_MSK  (((1U << DMA_DSTPERIPHERAL_LEN) - 1) << DMA_DSTPERIPHERAL_POS)
#define DMA_DSTPERIPHERAL_UMSK (~(((1U << DMA_DSTPERIPHERAL_LEN) - 1) << DMA_DSTPERIPHERAL_POS))
#define DMA_FLOWCNTRL          DMA_FLOWCNTRL
#define DMA_FLOWCNTRL_POS      (11U)
#define DMA_FLOWCNTRL_LEN      (3U)
#define DMA_FLOWCNTRL_MSK      (((1U << DMA_FLOWCNTRL_LEN) - 1) << DMA_FLOWCNTRL_POS)
#define DMA_FLOWCNTRL_UMSK     (~(((1U << DMA_FLOWCNTRL_LEN) - 1) << DMA_FLOWCNTRL_POS))
#define DMA_IE                 DMA_IE
#define DMA_IE_POS             (14U)
#define DMA_IE_LEN             (1U)
#define DMA_IE_MSK             (((1U << DMA_IE_LEN) - 1) << DMA_IE_POS)
#define DMA_IE_UMSK            (~(((1U << DMA_IE_LEN) - 1) << DMA_IE_POS))
#define DMA_ITC                DMA_ITC
#define DMA_ITC_POS            (15U)
#define DMA_ITC_LEN            (1U)
#define DMA_ITC_MSK            (((1U << DMA_ITC_LEN) - 1) << DMA_ITC_POS)
#define DMA_ITC_UMSK           (~(((1U << DMA_ITC_LEN) - 1) << DMA_ITC_POS))
#define DMA_L                  DMA_L
#define DMA_L_POS              (16U)
#define DMA_L_LEN              (1U)
#define DMA_L_MSK              (((1U << DMA_L_LEN) - 1) << DMA_L_POS)
#define DMA_L_UMSK             (~(((1U << DMA_L_LEN) - 1) << DMA_L_POS))
#define DMA_A                  DMA_A
#define DMA_A_POS              (17U)
#define DMA_A_LEN              (1U)
#define DMA_A_MSK              (((1U << DMA_A_LEN) - 1) << DMA_A_POS)
#define DMA_A_UMSK             (~(((1U << DMA_A_LEN) - 1) << DMA_A_POS))
#define DMA_H                  DMA_H
#define DMA_H_POS              (18U)
#define DMA_H_LEN              (1U)
#define DMA_H_MSK              (((1U << DMA_H_LEN) - 1) << DMA_H_POS)
#define DMA_H_UMSK             (~(((1U << DMA_H_LEN) - 1) << DMA_H_POS))
#define DMA_LLICOUNTER         DMA_LLICOUNTER
#define DMA_LLICOUNTER_POS     (20U)
#define DMA_LLICOUNTER_LEN     (10U)
#define DMA_LLICOUNTER_MSK     (((1U << DMA_LLICOUNTER_LEN) - 1) << DMA_LLICOUNTER_POS)
#define DMA_LLICOUNTER_UMSK    (~(((1U << DMA_LLICOUNTER_LEN) - 1) << DMA_LLICOUNTER_POS))

/* 0x200 : DMA_C1SrcAddr */
#define DMA_C1SRCADDR_OFFSET   (0x200)
#define DMA_SRCADDR            DMA_SRCADDR
#define DMA_SRCADDR_POS        (0U)
#define DMA_SRCADDR_LEN        (32U)
#define DMA_SRCADDR_MSK        (((1U << DMA_SRCADDR_LEN) - 1) << DMA_SRCADDR_POS)
#define DMA_SRCADDR_UMSK       (~(((1U << DMA_SRCADDR_LEN) - 1) << DMA_SRCADDR_POS))

/* 0x204 : DMA_C1DstAddr */
#define DMA_C1DSTADDR_OFFSET   (0x204)
#define DMA_DSTADDR            DMA_DSTADDR
#define DMA_DSTADDR_POS        (0U)
#define DMA_DSTADDR_LEN        (32U)
#define DMA_DSTADDR_MSK        (((1U << DMA_DSTADDR_LEN) - 1) << DMA_DSTADDR_POS)
#define DMA_DSTADDR_UMSK       (~(((1U << DMA_DSTADDR_LEN) - 1) << DMA_DSTADDR_POS))

/* 0x208 : DMA_C1LLI */
#define DMA_C1LLI_OFFSET       (0x208)
#define DMA_LLI                DMA_LLI
#define DMA_LLI_POS            (0U)
#define DMA_LLI_LEN            (32U)
#define DMA_LLI_MSK            (((1U << DMA_LLI_LEN) - 1) << DMA_LLI_POS)
#define DMA_LLI_UMSK           (~(((1U << DMA_LLI_LEN) - 1) << DMA_LLI_POS))

/* 0x20C : DMA_C1Control */
#define DMA_C1CONTROL_OFFSET   (0x20C)
#define DMA_TRANSFERSIZE       DMA_TRANSFERSIZE
#define DMA_TRANSFERSIZE_POS   (0U)
#define DMA_TRANSFERSIZE_LEN   (12U)
#define DMA_TRANSFERSIZE_MSK   (((1U << DMA_TRANSFERSIZE_LEN) - 1) << DMA_TRANSFERSIZE_POS)
#define DMA_TRANSFERSIZE_UMSK  (~(((1U << DMA_TRANSFERSIZE_LEN) - 1) << DMA_TRANSFERSIZE_POS))
#define DMA_SBSIZE             DMA_SBSIZE
#define DMA_SBSIZE_POS         (12U)
#define DMA_SBSIZE_LEN         (2U)
#define DMA_SBSIZE_MSK         (((1U << DMA_SBSIZE_LEN) - 1) << DMA_SBSIZE_POS)
#define DMA_SBSIZE_UMSK        (~(((1U << DMA_SBSIZE_LEN) - 1) << DMA_SBSIZE_POS))
#define DMA_DST_MIN_MODE       DMA_DST_MIN_MODE
#define DMA_DST_MIN_MODE_POS   (14U)
#define DMA_DST_MIN_MODE_LEN   (1U)
#define DMA_DST_MIN_MODE_MSK   (((1U << DMA_DST_MIN_MODE_LEN) - 1) << DMA_DST_MIN_MODE_POS)
#define DMA_DST_MIN_MODE_UMSK  (~(((1U << DMA_DST_MIN_MODE_LEN) - 1) << DMA_DST_MIN_MODE_POS))
#define DMA_DBSIZE             DMA_DBSIZE
#define DMA_DBSIZE_POS         (15U)
#define DMA_DBSIZE_LEN         (2U)
#define DMA_DBSIZE_MSK         (((1U << DMA_DBSIZE_LEN) - 1) << DMA_DBSIZE_POS)
#define DMA_DBSIZE_UMSK        (~(((1U << DMA_DBSIZE_LEN) - 1) << DMA_DBSIZE_POS))
#define DMA_DST_ADD_MODE       DMA_DST_ADD_MODE
#define DMA_DST_ADD_MODE_POS   (17U)
#define DMA_DST_ADD_MODE_LEN   (1U)
#define DMA_DST_ADD_MODE_MSK   (((1U << DMA_DST_ADD_MODE_LEN) - 1) << DMA_DST_ADD_MODE_POS)
#define DMA_DST_ADD_MODE_UMSK  (~(((1U << DMA_DST_ADD_MODE_LEN) - 1) << DMA_DST_ADD_MODE_POS))
#define DMA_SWIDTH             DMA_SWIDTH
#define DMA_SWIDTH_POS         (18U)
#define DMA_SWIDTH_LEN         (3U)
#define DMA_SWIDTH_MSK         (((1U << DMA_SWIDTH_LEN) - 1) << DMA_SWIDTH_POS)
#define DMA_SWIDTH_UMSK        (~(((1U << DMA_SWIDTH_LEN) - 1) << DMA_SWIDTH_POS))
#define DMA_DWIDTH             DMA_DWIDTH
#define DMA_DWIDTH_POS         (21U)
#define DMA_DWIDTH_LEN         (3U)
#define DMA_DWIDTH_MSK         (((1U << DMA_DWIDTH_LEN) - 1) << DMA_DWIDTH_POS)
#define DMA_DWIDTH_UMSK        (~(((1U << DMA_DWIDTH_LEN) - 1) << DMA_DWIDTH_POS))
#define DMA_FIX_CNT            DMA_FIX_CNT
#define DMA_FIX_CNT_POS        (23U)
#define DMA_FIX_CNT_LEN        (2U)
#define DMA_FIX_CNT_MSK        (((1U << DMA_FIX_CNT_LEN) - 1) << DMA_FIX_CNT_POS)
#define DMA_FIX_CNT_UMSK       (~(((1U << DMA_FIX_CNT_LEN) - 1) << DMA_FIX_CNT_POS))
#define DMA_SI                 DMA_SI
#define DMA_SI_POS             (26U)
#define DMA_SI_LEN             (1U)
#define DMA_SI_MSK             (((1U << DMA_SI_LEN) - 1) << DMA_SI_POS)
#define DMA_SI_UMSK            (~(((1U << DMA_SI_LEN) - 1) << DMA_SI_POS))
#define DMA_DI                 DMA_DI
#define DMA_DI_POS             (27U)
#define DMA_DI_LEN             (1U)
#define DMA_DI_MSK             (((1U << DMA_DI_LEN) - 1) << DMA_DI_POS)
#define DMA_DI_UMSK            (~(((1U << DMA_DI_LEN) - 1) << DMA_DI_POS))
#define DMA_PROT               DMA_PROT
#define DMA_PROT_POS           (28U)
#define DMA_PROT_LEN           (3U)
#define DMA_PROT_MSK           (((1U << DMA_PROT_LEN) - 1) << DMA_PROT_POS)
#define DMA_PROT_UMSK          (~(((1U << DMA_PROT_LEN) - 1) << DMA_PROT_POS))
#define DMA_I                  DMA_I
#define DMA_I_POS              (31U)
#define DMA_I_LEN              (1U)
#define DMA_I_MSK              (((1U << DMA_I_LEN) - 1) << DMA_I_POS)
#define DMA_I_UMSK             (~(((1U << DMA_I_LEN) - 1) << DMA_I_POS))

/* 0x210 : DMA_C1Config */
#define DMA_C1CONFIG_OFFSET    (0x210)
#define DMA_E                  DMA_E
#define DMA_E_POS              (0U)
#define DMA_E_LEN              (1U)
#define DMA_E_MSK              (((1U << DMA_E_LEN) - 1) << DMA_E_POS)
#define DMA_E_UMSK             (~(((1U << DMA_E_LEN) - 1) << DMA_E_POS))
#define DMA_SRCPERIPHERAL      DMA_SRCPERIPHERAL
#define DMA_SRCPERIPHERAL_POS  (1U)
#define DMA_SRCPERIPHERAL_LEN  (5U)
#define DMA_SRCPERIPHERAL_MSK  (((1U << DMA_SRCPERIPHERAL_LEN) - 1) << DMA_SRCPERIPHERAL_POS)
#define DMA_SRCPERIPHERAL_UMSK (~(((1U << DMA_SRCPERIPHERAL_LEN) - 1) << DMA_SRCPERIPHERAL_POS))
#define DMA_DSTPERIPHERAL      DMA_DSTPERIPHERAL
#define DMA_DSTPERIPHERAL_POS  (6U)
#define DMA_DSTPERIPHERAL_LEN  (5U)
#define DMA_DSTPERIPHERAL_MSK  (((1U << DMA_DSTPERIPHERAL_LEN) - 1) << DMA_DSTPERIPHERAL_POS)
#define DMA_DSTPERIPHERAL_UMSK (~(((1U << DMA_DSTPERIPHERAL_LEN) - 1) << DMA_DSTPERIPHERAL_POS))
#define DMA_FLOWCNTRL          DMA_FLOWCNTRL
#define DMA_FLOWCNTRL_POS      (11U)
#define DMA_FLOWCNTRL_LEN      (3U)
#define DMA_FLOWCNTRL_MSK      (((1U << DMA_FLOWCNTRL_LEN) - 1) << DMA_FLOWCNTRL_POS)
#define DMA_FLOWCNTRL_UMSK     (~(((1U << DMA_FLOWCNTRL_LEN) - 1) << DMA_FLOWCNTRL_POS))
#define DMA_IE                 DMA_IE
#define DMA_IE_POS             (14U)
#define DMA_IE_LEN             (1U)
#define DMA_IE_MSK             (((1U << DMA_IE_LEN) - 1) << DMA_IE_POS)
#define DMA_IE_UMSK            (~(((1U << DMA_IE_LEN) - 1) << DMA_IE_POS))
#define DMA_ITC                DMA_ITC
#define DMA_ITC_POS            (15U)
#define DMA_ITC_LEN            (1U)
#define DMA_ITC_MSK            (((1U << DMA_ITC_LEN) - 1) << DMA_ITC_POS)
#define DMA_ITC_UMSK           (~(((1U << DMA_ITC_LEN) - 1) << DMA_ITC_POS))
#define DMA_L                  DMA_L
#define DMA_L_POS              (16U)
#define DMA_L_LEN              (1U)
#define DMA_L_MSK              (((1U << DMA_L_LEN) - 1) << DMA_L_POS)
#define DMA_L_UMSK             (~(((1U << DMA_L_LEN) - 1) << DMA_L_POS))
#define DMA_A                  DMA_A
#define DMA_A_POS              (17U)
#define DMA_A_LEN              (1U)
#define DMA_A_MSK              (((1U << DMA_A_LEN) - 1) << DMA_A_POS)
#define DMA_A_UMSK             (~(((1U << DMA_A_LEN) - 1) << DMA_A_POS))
#define DMA_H                  DMA_H
#define DMA_H_POS              (18U)
#define DMA_H_LEN              (1U)
#define DMA_H_MSK              (((1U << DMA_H_LEN) - 1) << DMA_H_POS)
#define DMA_H_UMSK             (~(((1U << DMA_H_LEN) - 1) << DMA_H_POS))

/* 0x300 : DMA_C2SrcAddr */
#define DMA_C2SRCADDR_OFFSET   (0x300)
#define DMA_SRCADDR            DMA_SRCADDR
#define DMA_SRCADDR_POS        (0U)
#define DMA_SRCADDR_LEN        (32U)
#define DMA_SRCADDR_MSK        (((1U << DMA_SRCADDR_LEN) - 1) << DMA_SRCADDR_POS)
#define DMA_SRCADDR_UMSK       (~(((1U << DMA_SRCADDR_LEN) - 1) << DMA_SRCADDR_POS))

/* 0x304 : DMA_C2DstAddr */
#define DMA_C2DSTADDR_OFFSET   (0x304)
#define DMA_DSTADDR            DMA_DSTADDR
#define DMA_DSTADDR_POS        (0U)
#define DMA_DSTADDR_LEN        (32U)
#define DMA_DSTADDR_MSK        (((1U << DMA_DSTADDR_LEN) - 1) << DMA_DSTADDR_POS)
#define DMA_DSTADDR_UMSK       (~(((1U << DMA_DSTADDR_LEN) - 1) << DMA_DSTADDR_POS))

/* 0x308 : DMA_C2LLI */
#define DMA_C2LLI_OFFSET       (0x308)
#define DMA_LLI                DMA_LLI
#define DMA_LLI_POS            (0U)
#define DMA_LLI_LEN            (32U)
#define DMA_LLI_MSK            (((1U << DMA_LLI_LEN) - 1) << DMA_LLI_POS)
#define DMA_LLI_UMSK           (~(((1U << DMA_LLI_LEN) - 1) << DMA_LLI_POS))

