Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl702_driver/regs/dma_reg.h
    /* 0x30C : DMA_C2Control */
    union
    {
        struct
        {
            uint32_t TransferSize                   : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t SBSize                         :  2; /* [13:12],        r/w,        0x1 */
            uint32_t dst_min_mode                   :  1; /* [   14],        r/w,        0x0 */
            uint32_t DBSize                         :  2; /* [16:15],        r/w,        0x1 */
            uint32_t dst_add_mode                   :  1; /* [   17],        r/w,        0x0 */
            uint32_t SWidth                         :  2; /* [19:18],        r/w,        0x2 */
            uint32_t reserved_20                    :  1; /* [   20],       rsvd,        0x0 */
            uint32_t DWidth                         :  2; /* [22:21],        r/w,        0x2 */
            uint32_t fix_cnt                        :  2; /* [24:23],        r/w,        0x0 */
            uint32_t SLargerD                       :  1; /* [   25],        r/w,        0x0 */
            uint32_t SI                             :  1; /* [   26],        r/w,        0x1 */
            uint32_t DI                             :  1; /* [   27],        r/w,        0x1 */
            uint32_t Prot                           :  3; /* [30:28],        r/w,        0x0 */
            uint32_t I                              :  1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C2Control;

    /* 0x310 : DMA_C2Config */
    union
    {
        struct
        {
            uint32_t E                              :  1; /* [    0],        r/w,        0x0 */
            uint32_t SrcPeripheral                  :  5; /* [ 5: 1],        r/w,        0x0 */
            uint32_t DstPeripheral                  :  5; /* [10: 6],        r/w,        0x0 */
            uint32_t FlowCntrl                      :  3; /* [13:11],        r/w,        0x0 */
            uint32_t IE                             :  1; /* [   14],        r/w,        0x0 */
            uint32_t ITC                            :  1; /* [   15],        r/w,        0x0 */
            uint32_t L                              :  1; /* [   16],        r/w,        0x0 */
            uint32_t A                              :  1; /* [   17],          r,        0x0 */
            uint32_t H                              :  1; /* [   18],        r/w,        0x0 */
            uint32_t reserved_19_31                 : 13; /* [31:19],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C2Config;

    /* 0x314  reserved */
    uint8_t RESERVED0x314[236];

    /* 0x400 : DMA_C3SrcAddr */
    union
    {
        struct
        {
            uint32_t SrcAddr                        : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C3SrcAddr;

    /* 0x404 : DMA_C3DstAddr */
    union
    {
        struct
        {
            uint32_t DstAddr                        : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C3DstAddr;

    /* 0x408 : DMA_C3LLI */
    union
    {
        struct
        {
            uint32_t reserved_0_1                   :  2; /* [ 1: 0],       rsvd,        0x0 */
            uint32_t LLI                            : 30; /* [31: 2],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C3LLI;

    /* 0x40C : DMA_C3Control */
    union
    {
        struct
        {
            uint32_t TransferSize                   : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t SBSize                         :  2; /* [13:12],        r/w,        0x1 */
            uint32_t dst_min_mode                   :  1; /* [   14],        r/w,        0x0 */
            uint32_t DBSize                         :  2; /* [16:15],        r/w,        0x1 */
            uint32_t dst_add_mode                   :  1; /* [   17],        r/w,        0x0 */
            uint32_t SWidth                         :  2; /* [19:18],        r/w,        0x2 */
            uint32_t reserved_20                    :  1; /* [   20],       rsvd,        0x0 */
            uint32_t DWidth                         :  2; /* [22:21],        r/w,        0x2 */
            uint32_t fix_cnt                        :  2; /* [24:23],        r/w,        0x0 */
            uint32_t SLargerD                       :  1; /* [   25],        r/w,        0x0 */
            uint32_t SI                             :  1; /* [   26],        r/w,        0x1 */
            uint32_t DI                             :  1; /* [   27],        r/w,        0x1 */
            uint32_t Prot                           :  3; /* [30:28],        r/w,        0x0 */
            uint32_t I                              :  1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C3Control;

    /* 0x410 : DMA_C3Config */
    union
    {
        struct
        {
            uint32_t E                              :  1; /* [    0],        r/w,        0x0 */
            uint32_t SrcPeripheral                  :  5; /* [ 5: 1],        r/w,        0x0 */
            uint32_t DstPeripheral                  :  5; /* [10: 6],        r/w,        0x0 */
            uint32_t FlowCntrl                      :  3; /* [13:11],        r/w,        0x0 */
            uint32_t IE                             :  1; /* [   14],        r/w,        0x0 */
            uint32_t ITC                            :  1; /* [   15],        r/w,        0x0 */
            uint32_t L                              :  1; /* [   16],        r/w,        0x0 */
            uint32_t A                              :  1; /* [   17],          r,        0x0 */
            uint32_t H                              :  1; /* [   18],        r/w,        0x0 */
            uint32_t reserved_19_31                 : 13; /* [31:19],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C3Config;

    /* 0x414  reserved */
    uint8_t RESERVED0x414[236];

