Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl702_driver/regs/dma_reg.h
    /* 0x500 : DMA_C4SrcAddr */
    union
    {
        struct
        {
            uint32_t SrcAddr                        : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C4SrcAddr;

    /* 0x504 : DMA_C4DstAddr */
    union
    {
        struct
        {
            uint32_t DstAddr                        : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C4DstAddr;

    /* 0x508 : DMA_C4LLI */
    union
    {
        struct
        {
            uint32_t reserved_0_1                   :  2; /* [ 1: 0],       rsvd,        0x0 */
            uint32_t LLI                            : 30; /* [31: 2],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C4LLI;

    /* 0x50C : DMA_C4Control */
    union
    {
        struct
        {
            uint32_t TransferSize                   : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t SBSize                         :  2; /* [13:12],        r/w,        0x1 */
            uint32_t dst_min_mode                   :  1; /* [   14],        r/w,        0x0 */
            uint32_t DBSize                         :  2; /* [16:15],        r/w,        0x1 */
            uint32_t dst_add_mode                   :  1; /* [   17],        r/w,        0x0 */
            uint32_t SWidth                         :  2; /* [19:18],        r/w,        0x2 */
            uint32_t reserved_20                    :  1; /* [   20],       rsvd,        0x0 */
            uint32_t DWidth                         :  2; /* [22:21],        r/w,        0x2 */
            uint32_t fix_cnt                        :  2; /* [24:23],        r/w,        0x0 */
            uint32_t SLargerD                       :  1; /* [   25],        r/w,        0x0 */
            uint32_t SI                             :  1; /* [   26],        r/w,        0x1 */
            uint32_t DI                             :  1; /* [   27],        r/w,        0x1 */
            uint32_t Prot                           :  3; /* [30:28],        r/w,        0x0 */
            uint32_t I                              :  1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C4Control;

    /* 0x510 : DMA_C4Config */
    union
    {
        struct
        {
            uint32_t E                              :  1; /* [    0],        r/w,        0x0 */
            uint32_t SrcPeripheral                  :  5; /* [ 5: 1],        r/w,        0x0 */
            uint32_t DstPeripheral                  :  5; /* [10: 6],        r/w,        0x0 */
            uint32_t FlowCntrl                      :  3; /* [13:11],        r/w,        0x0 */
            uint32_t IE                             :  1; /* [   14],        r/w,        0x0 */
            uint32_t ITC                            :  1; /* [   15],        r/w,        0x0 */
            uint32_t L                              :  1; /* [   16],        r/w,        0x0 */
            uint32_t A                              :  1; /* [   17],          r,        0x0 */
            uint32_t H                              :  1; /* [   18],        r/w,        0x0 */
            uint32_t reserved_19_31                 : 13; /* [31:19],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C4Config;

    /* 0x514  reserved */
    uint8_t RESERVED0x514[236];

    /* 0x600 : DMA_C5SrcAddr */
    union
    {
        struct
        {
            uint32_t SrcAddr                        : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C5SrcAddr;

    /* 0x604 : DMA_C5DstAddr */
    union
    {
        struct
        {
            uint32_t DstAddr                        : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C5DstAddr;

    /* 0x608 : DMA_C5LLI */
    union
    {
        struct
        {
            uint32_t reserved_0_1                   :  2; /* [ 1: 0],       rsvd,        0x0 */
            uint32_t LLI                            : 30; /* [31: 2],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C5LLI;

    /* 0x60C : DMA_C5Control */
    union
    {
        struct
        {
            uint32_t TransferSize                   : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t SBSize                         :  2; /* [13:12],        r/w,        0x1 */
            uint32_t dst_min_mode                   :  1; /* [   14],        r/w,        0x0 */
            uint32_t DBSize                         :  2; /* [16:15],        r/w,        0x1 */
            uint32_t dst_add_mode                   :  1; /* [   17],        r/w,        0x0 */
            uint32_t SWidth                         :  2; /* [19:18],        r/w,        0x2 */
            uint32_t reserved_20                    :  1; /* [   20],       rsvd,        0x0 */
            uint32_t DWidth                         :  2; /* [22:21],        r/w,        0x2 */
            uint32_t fix_cnt                        :  2; /* [24:23],        r/w,        0x0 */
            uint32_t SLargerD                       :  1; /* [   25],        r/w,        0x0 */
            uint32_t SI                             :  1; /* [   26],        r/w,        0x1 */
            uint32_t DI                             :  1; /* [   27],        r/w,        0x1 */
            uint32_t Prot                           :  3; /* [30:28],        r/w,        0x0 */
            uint32_t I                              :  1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C5Control;

    /* 0x610 : DMA_C5Config */
    union
    {
        struct
        {
            uint32_t E                              :  1; /* [    0],        r/w,        0x0 */
            uint32_t SrcPeripheral                  :  5; /* [ 5: 1],        r/w,        0x0 */
            uint32_t DstPeripheral                  :  5; /* [10: 6],        r/w,        0x0 */
            uint32_t FlowCntrl                      :  3; /* [13:11],        r/w,        0x0 */
            uint32_t IE                             :  1; /* [   14],        r/w,        0x0 */
            uint32_t ITC                            :  1; /* [   15],        r/w,        0x0 */
            uint32_t L                              :  1; /* [   16],        r/w,        0x0 */
            uint32_t A                              :  1; /* [   17],          r,        0x0 */
            uint32_t H                              :  1; /* [   18],        r/w,        0x0 */
            uint32_t reserved_19_31                 : 13; /* [31:19],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C5Config;

    /* 0x614  reserved */
    uint8_t RESERVED0x614[236];

    /* 0x700 : DMA_C6SrcAddr */
    union
    {
        struct
        {
            uint32_t SrcAddr                        : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_C6SrcAddr;

